
<?php

function average($a, $b, $c, $d){ //პარამეტრად გადავცემთ 4 ცვლადს

    return 
        ($a + $b+ $c + $d) / 4; //პარამერთა ჯამს ვყოფთ არგუმენტების რაოდენობაზე
        
}

echo average(10,20,30,40); // გადავცემთ არგუმენტებს ფუნქციას და ვბეჭდავთ

echo "<br />";


//რიცხვთა ჯამის საშუალოს გასაანგარიშებელი ფორმულა,

function average_2(...$numbers) {  // $numbers ცვლადში შეინახება მასივი იმ არგუმენტების რასაც გადავცემთ გამოძახებისას
    $sum = array_sum($numbers); // array_sum($numbers) დაითვლის გადაცემული არგუმენტების ჯამს
    $count = count($numbers);  // count($numbers) დაითვლის რამდენი პარამეტრია გადაცემული
    
        return $sum / $count;  //არგუმენთთა ჯამს ვყოფთ არგუმენტების რაოდენობაზე
}

echo average_2(1,2,3,4,5,6,7,8,9,10); 


?>